---
kind: property
id: P:Autodesk.Revit.DB.Visual.Wave.WaveWaveLenMin
source: html/77a4660e-a59f-1a10-5ab0-38edafa84251.htm
---
# Autodesk.Revit.DB.Visual.Wave.WaveWaveLenMin Property

The property labeled "Len Min" from the "Wave" schema.

## Syntax (C#)
```csharp
public static string WaveWaveLenMin { get; }
```

## Remarks
This property is of type "AssetPropertyDouble" within the range of "0, 1000000000".